bringup-note.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Human" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org2c89e41" class="outline-2">
<h2 id="org2c89e41">一些点灯思路</h2>
<div class="outline-text-2" id="text-org2c89e41">
</div>
<div id="outline-container-org2e13543" class="outline-3">
<h3 id="org2e13543">烧录程序</h3>
<div class="outline-text-3" id="text-org2e13543">
<p>
没有系统之前可以通过判断:
</p>

<ol class="org-ol">
<li>BROM提供的烧录程序是否工作，比如USB/网络/串口</li>

<li>接调试串口查看是否有内容输出</li>
</ol>
</div>
</div>

<div id="outline-container-orga31cb86" class="outline-3">
<h3 id="orga31cb86">串口调通之前的bringup</h3>
<div class="outline-text-3" id="text-orga31cb86">
<p>
最简单的方法就是点亮一个led来判断代码的状态:
</p>
</div>

<div id="outline-container-org277db66" class="outline-4">
<h4 id="org277db66">汇编</h4>
<div class="outline-text-4" id="text-org277db66">
<p>
如果怀疑启动的汇编代码有问题，则可以通过汇编进行以下操作:
</p>

<ol class="org-ol">
<li>读写寄存器来设置led所在引脚的pinmux</li>
<li>读写寄存器来设置led所在引脚的输入输出方向</li>
<li>读写寄存器来设置led所在引脚的电平</li>
<li>读写寄存器来设置led所在引脚的驱动能力(可选，如果点不亮再尝试)</li>
</ol>

<p>
下面是一个wch ch58x的例子:
</p>

<div class="org-src-container">
<pre class="src src-asm"><code>.equ R32_PB_DIR, 0x400010c0</code>
<code>.equ R32_PB_OUT, 0x400010c8</code>
<code>li t0, R32_PB_DIR</code>
<code>lw t1, 0(t0)</code>
<code>ori t1, t1, (1 &lt;&lt; 4)</code>
<code>sw t1, 0(t0)</code>
<code>li t0, R32_PB_OUT</code>
<code>lw t1, 0(t0)</code>
<code>ori t1, t1, (1 &lt;&lt; 4)</code>
<code>sw t1, 0(t0)</code>
</pre>
</div>
</div>
</div>


<div id="outline-container-org7918a25" class="outline-4">
<h4 id="org7918a25">C</h4>
<div class="outline-text-4" id="text-org7918a25">
<p>
如果汇编阶段没有问题的话，就可以从C代码中点灯来判断哪里卡住了
</p>

<p>
思路和上面汇编一样，下面是一个wch ch58x的例子:
</p>

<div class="org-src-container">
<pre class="src src-c"><code>#define R32_PB_DIR 0x400010c0</code>
<code>#define R32_PB_OUT 0x400010c8</code>
<code>uint32_t val;</code>
<code>// led on</code>
<code>val = ioread32((void *)R32_PB_DIR);</code>
<code>val |= (1 &lt;&lt; 4);</code>
<code>iowrite32(val, (void *)R32_PB_DIR);</code>
<code>val = ioread32((void *)R32_PB_OUT);</code>
<code>val |= (1 &lt;&lt; 4);</code>
<code>iowrite32(val, (void *)R32_PB_OUT);</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a61f02" class="outline-4">
<h4 id="org5a61f02">JTAG/SWD</h4>
<div class="outline-text-4" id="text-org5a61f02">
<p>
如果条件允许的情况下可以使用带外的调试接口进行调试。
</p>
</div>
</div>
</div>

<div id="outline-container-org555cfea" class="outline-3">
<h3 id="org555cfea">串口调通之后的bringup</h3>
<div class="outline-text-3" id="text-org555cfea">
<p>
串口调通之后的bringup就很简单了:
</p>

<ol class="org-ol">
<li>打开调试信息，比如出错地方的backtrace，寄存器dump，以及代码内置的调试打印</li>
<li>在怀疑的地方打上printf来调试。</li>
</ol>
</div>
</div>

<div id="outline-container-org430eeaf" class="outline-3">
<h3 id="org430eeaf">非法指令和段错误</h3>
<div class="outline-text-3" id="text-org430eeaf">
</div>
<div id="outline-container-org182b282" class="outline-4">
<h4 id="org182b282">代码问题</h4>
<div class="outline-text-4" id="text-org182b282">
<p>
通过调试器或printf来诊断代码
</p>
</div>
</div>

<div id="outline-container-orga63b887" class="outline-4">
<h4 id="orga63b887">编译器问题</h4>
<div class="outline-text-4" id="text-orga63b887">
<p>
检查编译器的优化参数，如果打开了CPU不支持的特性则会出现sigill和sigsev，通常出现在riscv平台。
</p>
</div>
</div>

<div id="outline-container-org8d04144" class="outline-4">
<h4 id="org8d04144">DDR 问题</h4>
<div class="outline-text-4" id="text-org8d04144">
<p>
尝试更改DDR初始化参数，然后压力测试来确定出问题的参数范围。
</p>
</div>
</div>

<div id="outline-container-org036fd7b" class="outline-4">
<h4 id="org036fd7b">内核电压问题</h4>
<div class="outline-text-4" id="text-org036fd7b">
<p>
带有TPU核的SOC对内核电压要求很严格，有些大陆厂的SOC需要通过超频来达到宣传的性能，可以尝试:
</p>

<ol class="org-ol">
<li>调高一点内核电压，需要注意电压上限。</li>
<li>降低一点clk freq，需要注意分频范围。</li>
</ol>

<p>
然后进行压力测试
</p>
</div>
</div>
</div>

<div id="outline-container-org56a8b6a" class="outline-3">
<h3 id="org56a8b6a">内存压力测试</h3>
<div class="outline-text-3" id="text-org56a8b6a">
</div>
<div id="outline-container-orgd3c304e" class="outline-4">
<h4 id="orgd3c304e">普通的压力测试</h4>
<div class="outline-text-4" id="text-orgd3c304e">
<p>
将memtest程序运行在bootloader/linux系统
</p>
</div>
</div>

<div id="outline-container-org7e18adb" class="outline-4">
<h4 id="org7e18adb">带有DMA的压力测试</h4>
<div class="outline-text-4" id="text-org7e18adb">
<p>
可以进行压力测试的几个高速外设控制器:
</p>

<ol class="org-ol">
<li>显示控制器，压力测试时候将参数调高，控制器会持续DMA读取DDR中的内容</li>

<li>摄像头控制器，压力测试时可以将摄像头打开，控制器会持续DMA写入图像到DDR</li>

<li>网卡控制器，压力测试时候可以将网卡的dma ring调为合适的大小（当然，越大越好），然后进行网络收发压力测试</li>

<li>显卡控制器，压力测试时候可以将GPU的DMA开满，如果有条件可以调用GPU来编写一个内存测试程序，比如全志社区的lima-memtester</li>

<li>USB控制器，可以接多个USB网卡进行压力测试，或找一个可以跑满带宽的板子进行echo测试。</li>

<li>内存到内存的DMA，可以在内存测试程序中写一个带dma的memcpy</li>
</ol>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Last updated: 2024-04-22</p>
</div>
</body>
</html>
